real_runs/a100_qwen7b/verify/qwen7b/gpu_a100/verify_chatbot_sharegpt/logs/bench_client.log
INFO 07-15 07:21:58 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff1b3c27600>, seed=0, num_prompts=200, dataset_name='sharegpt', no_stream=False, dataset_path='/home/ubuntu/LLM/real_runs/datasets/sharegpt/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=18201, endpoint='/v1/completions', max_concurrency=None, model='Qwen/Qwen2.5-Coder-7B-Instruct', tokenizer='Qwen/Qwen2.5-Coder-7B-Instruct', use_beam_search=False, logprobs=None, request_rate=2.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['max_model_len=32768'], result_dir='/home/ubuntu/LLM/real_runs/a100_qwen7b/verify/qwen7b/gpu_a100/verify_chatbot_sharegpt/results', result_filename='bench_serve.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='qwen7b-gpu_a100', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:01 elapsed, 77:49:24 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 200/200 [01:48<00:00,  1.85it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Request rate configured (RPS):           2.00      
Benchmark duration (s):                  108.04    
Total input tokens:                      43560     
Total generated tokens:                  36311     
Request throughput (req/s):              1.85      
Output token throughput (tok/s):         336.09    
Total Token throughput (tok/s):          739.28    
---------------Time to First Token----------------
Mean TTFT (ms):                          41.48     
Median TTFT (ms):                        37.20     
P99 TTFT (ms):                           79.48     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.59     
Median TPOT (ms):                        14.45     
P99 TPOT (ms):                           17.31     
---------------Inter-token Latency----------------
Mean ITL (ms):                           14.53     
Median ITL (ms):                         13.81     
P99 ITL (ms):                            33.13     
==================================================